In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'Nombre': ["Juan", "Gabriela", "Elena"], 'Edad': [23, 31, 21]})
df1

     Nombre  Edad
0      Juan    23
1  Gabriela    31
2     Elena    21

In [3]:
df2 = pd.DataFrame({"Nombre": ["Carmela", "Max", "Laura"], "Edad": [34, 25, 29]})
df2

    Nombre  Edad
0  Carmela    34
1      Max    25
2    Laura    29

In [4]:
df_concatenado = pd.concat([df1,df2])
df_concatenado

     Nombre  Edad
0      Juan    23
1  Gabriela    31
2     Elena    21
0   Carmela    34
1       Max    25
2     Laura    29

In [5]:
df_concatenado2 = pd.concat([df1, df2], axis=True)
df_concatenado2

     Nombre  Edad   Nombre  Edad
0      Juan    23  Carmela    34
1  Gabriela    31      Max    25
2     Elena    21    Laura    29

In [8]:
df_concatenado = pd.concat([df1,df2], keys= ['df1', 'df2'], ignore_index=True)
df_concatenado

     Nombre  Edad
0      Juan    23
1  Gabriela    31
2     Elena    21
3   Carmela    34
4       Max    25
5     Laura    29

In [10]:
df_concatenado = pd.concat([df1,df2], keys= ['Enero', 'Febrero']) #Supongamos que son ventas y las puedo agrupar por meses
df_concatenado

             Nombre  Edad
Enero   0      Juan    23
        1  Gabriela    31
        2     Elena    21
Febrero 0   Carmela    34
        1       Max    25
        2     Laura    29

Ejercicio

In [11]:
datos_cliente = pd.DataFrame({'Nombre': ["Ana", "Luis", "Marta"], 'Edad': [34, 45, 28]})
compras_cliente = pd.DataFrame({'Producto': ["Libro", "Lápiz", "Cuaderno"], 'Precio': [15.50, 0.50, 2.00]})

info_cliente = pd.concat([datos_cliente, compras_cliente], axis=True)

In [12]:
info_cliente

  Nombre  Edad  Producto  Precio
0    Ana    34     Libro    15.5
1   Luis    45     Lápiz     0.5
2  Marta    28  Cuaderno     2.0